In [47]:
import pandas as pd 
df = pd.read_csv(r"C:\Users\alisa\OneDrive\Desktop\Machine Learning Note\Encoding\cars.csv")
df.sample(3)

        brand  km_driven    fuel         owner  selling_price
5525   Maruti     145000  Diesel   Third Owner         350000
7421     Tata     175000  Diesel  Second Owner         210000
6799  Hyundai     100000  Diesel  Second Owner         450000

In [48]:
df["brand"].nunique() # 32 diff class hai

32

In [49]:
df['fuel'].unique()

array(['Diesel', 'Petrol', 'LPG', 'CNG'], dtype=object)

In [50]:
df.sample(2)

       brand  km_driven    fuel        owner  selling_price
38    Datsun      42000  Petrol  First Owner         150000
2157  Maruti      30000  Diesel  First Owner         620000

OHE

In [51]:
from sklearn.model_selection import train_test_split
X_train , X_test , y_train , y_test = train_test_split(df.iloc[:,0:4], df.iloc[:,-1:] , test_size=.3 ,random_state=0)

In [52]:
X_train

           brand  km_driven    fuel         owner
5224        Tata      20000  Petrol   First Owner
520       Maruti      30000  Petrol   First Owner
36        Maruti      15000  Petrol   First Owner
5782        Ford      53000  Diesel   First Owner
6522   Chevrolet     120000  Diesel   First Owner
...          ...        ...     ...           ...
4931        Tata      70000  Diesel   Third Owner
3264        Ford     100000  Diesel  Second Owner
1653     Hyundai      90000  Petrol  Second Owner
2607  Volkswagen      90000  Diesel   First Owner
2732     Hyundai     110000  Petrol   First Owner

[5689 rows x 4 columns]

In [53]:
import numpy as np
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(drop='first', dtype=np.int32)

Consept Isska note me hai

In [54]:
X_train_new = ohe.fit_transform(X_train[['fuel' , 'owner']]).toarray()
X_test_new = ohe.fit_transform(X_test[['fuel' , 'owner']]).toarray()

In [55]:
X_train_new

array([[0, 0, 1, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0],
       ...,
       [0, 0, 1, ..., 1, 0, 0],
       [1, 0, 0, ..., 0, 0, 0],
       [0, 0, 1, ..., 0, 0, 0]])

In [56]:
X_train_new.shape # yahan kia hua fuel or owner ka part part hai

(5689, 7)

In [57]:
np.hstack((X_train[['brand' , 'km_driven']].values , X_train_new)) # concat kia me

array([['Tata', 20000, 0, ..., 0, 0, 0],
       ['Maruti', 30000, 0, ..., 0, 0, 0],
       ['Maruti', 15000, 0, ..., 0, 0, 0],
       ...,
       ['Hyundai', 90000, 0, ..., 1, 0, 0],
       ['Volkswagen', 90000, 1, ..., 0, 0, 0],
       ['Hyundai', 110000, 0, ..., 0, 0, 0]], dtype=object)

OneHotEncoding with Top Categories

In [58]:
df['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [59]:
counts = df['brand'].value_counts()

In [60]:
df['brand'].nunique()
threshold = 100

In [61]:
repl = counts[counts <= threshold].index

In [62]:
pd.get_dummies(df['brand'].replace(repl, 'uncommon')).sample(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,uncommon
324,False,False,False,False,False,False,True,False,False,False,False,False,False
7016,False,False,False,False,False,False,True,False,False,False,False,False,False
2071,False,False,False,False,False,True,False,False,False,False,False,False,False
2255,False,False,False,False,False,False,False,True,False,False,False,False,False
3738,False,False,False,False,False,False,False,False,False,False,False,True,False